Tekla Open API Reference for Tekla Structures 2025
Line Constructor (ViewBase, Point, Point)
 Creates a new line instance with two points and no bulge (straight line) using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line(
	ViewBase view,
	Point startPoint,
	Point endPoint
)
Public Sub New (
	view As ViewBase,
	startPoint As Point,
	endPoint As Point
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
See Also
Reference
Line Class
Line Overload
Tekla.Structures.Drawing Namespace